{
	"given-name":"Yu-Shiang",
	"sur-name":"Huang",
	"email":"F09946004@ntu.edu.tw",
	"www":"https://www.linkedin.com/in/yu-shiang-huang-309108126/",
	"bib":"yshuang",
	"summary":"I am a Ph.D. candidate in Data Science at National Taiwan University. My research interests include retrieval-enhanced machine learning (REML), natural language processing (NLP), and recommender systems (RecSys), with a particular focus on their applications in the financial domain.",
	"degrees":[
		{
			"degree":"Ph.D.",
			"school":"National Taiwan University",
			"discipline":"Data Science",
			"year": "Since 2022"
		},
		{
			"degree":"M.S.",
			"school":"National Taiwan University",
			"discipline":"Data Science",
			"year": "Admitted to the Ph.D. program in September 2022"
        },
		{
			"degree":"B.S.",
			"school":"National Taiwan University",
			"discipline":"Accounting",
			"year": 2020
		}
	],
	"employment":[
		{
			"title":"Graduate Student Researcher",
			"affiliation":"Academia Sinica",
			"location":"Taipei, Taiwan",
			"start-year":2020,
			"start-month":"September",
			"description":"- REML Research: Designed task formulation and an end-to-end retrieval-augmented pipeline to extract important signals from financial reports.\\\\ - RecSys Research: Designed experiments to validate the effectiveness of a new loss function compared to state-of-the-art (SOTA) recommendation methods.\\\\ - RecSys Industry Cooperation: Researched multi-behavior algorithms for banner recommendation systems and deployed the developed model in a real-world system with millions of users.\\\\ - NLP Research: Analyzed the characteristics of financial annual reports and designed a new algorithm to classify sentence relations based on these findings. Leveraging the results, we conducted transfer learning in a self-supervised setting, and our paper was accepted by ACL 2023.\\\\ - NLP Industry Cooperation: Fine-tuned BERT with a Siamese network and contrastive loss to obtain sentence embeddings in legal data, building a retrieval system aimed at finding the most relevant internal regulations."
		},		
		{
			"title":"Head Teaching Assistant, CSIE5043 Machine Learning",
			"affiliation":"National Taiwan University",
			"location":"Taipei, Taiwan",
			"start-year":2023,
			"start-month":"September",
			"end-year":2024,
			"end-month":"January",
			"description":"- Teaching Assistance: Led a team of 10 to assist in lecturing Machine Learning at National Taiwan University.\\\\ - Project Design: Designed the final project and maintained the data streaming pipeline.\\\\ - Homework Validation: Validated the homework problem sets related to machine learning theory."
		},		
		{
			"title":"Teaching Assistant, CSIE5043 Machine Learning",
			"affiliation":"National Taiwan University",
			"location":"Taipei, Taiwan",
			"start-year":2021,
			"start-month":"September",
			"end-year":2022,
			"end-month":"January",
			"description":"- Final Project Design: Created an in-class competition for a 300-student course by adding noise to an open dataset and testing competition metrics with various machine learning models.\\\\ - Assignment Validation and Consulting: Validated assignments to ensure accuracy in problem sets and provided answers to machine learning theory-related questions during TA hours."
		},		
		{
			"title":"Teaching Assistant, GENEDU5010 Programming and Web Scraping",
			"affiliation":"National Taiwan University",
			"location":"Taipei, Taiwan",
			"start-year":2021,
			"start-month":"Febuary",
			"end-year":2021,
			"end-month":"June",
			"description":"Instructional Support: Possessed a background in designing programming assignments and offering instructional support, allowing me to contribute effectively to teaching endeavors."
		},		
		{
			"title":"Part-time Quantitative Analyst",
			"affiliation":"beBit Inc.",
			"location":"Taipei, Taiwan",
			"start-year":2020,
			"start-month":"October",
			"end-year":2021,
			"end-month":"March",
			"description":"- Survey Data Analysis: Collaborated with a qualitative research team and applied statistical methods to verify business hypotheses and identify key factors in the customer experience journey.\\\\ - Methodology Establishment: Improved quantitative analysis methodology based on research papers and technical blogs, enhancing the persuasiveness of the final deliverable."
		},		
		{
			"title":"Project Assistant",
			"affiliation":"BluePlanet Technology",
			"location":"Taipei, Taiwan",
			"start-year":2019,
			"start-month":"November",
			"end-year":2021,
			"end-month":"Febuary",
			"description":"- Product Mechanism Design: Surveyed literature related to accounting and regulation to support the product mechanism design, resulting in the successful launch of the product in January 2021.\\\\ - Communication: Bridged the gap between the finance research group and the product management team by facilitating communication and recording discussion details during meetings."
		},		
		{
			"title":"Part-time Research Assistant",
			"affiliation":"National Taiwan University",
			"location":"Taipei, Taiwan",
			"start-year":2020,
			"start-month":"July",
			"end-year":2020,
			"end-month":"September",
			"description":"- Website Development at Department of Economics: Utilized Python to create a website for an economics experiment based on a research paper in experimental economics, catering to a participant pool of 100 individuals."
		},		
		{
			"title":"Intern",
			"affiliation":"Academia Sinica",
			"location":"Taipei, Taiwan",
			"start-year":2019,
			"start-month":"July",
			"end-year":2020,
			"end-month":"June",
			"description":"- Publication: Completed and submitted the work ``NFinBERT: A Number-Aware Language Model for Financial Disclosures'' to SwissText 2021, which has been accepted.\\\\ - Textual Data Analysis: Implemented machine learning models to conduct experiments on the relationship between financial report text and financial measures.\\\\ - Experimental Data Preparation: Collected SEC 10-K filings from 1993 to 2018 and performed data cleansing on the corpus through shell scripting, making the 330 GB data available for further research."
		},		
		{
			"title":"Teaching Material Assistant",
			"affiliation":"National Taiwan University",
			"location":"Taipei, Taiwan",
			"start-year":2018,
			"start-month":"November",
			"end-year":2019,
			"end-month":"January",
			"description":"- Teaching Material Creation at Department of Electronic Engineering: Self-studied advanced topics about kernel tricks in Support Vector Machines (SVM) in machine learning. Developed teaching slides with explainable examples beyond textbooks, aimed at making the theorems easier to understand."
		}
	],
	"bibliography":{
		"under-review":[
            "huang2024dagcf"
		],
		"conference-papers":[
            "ju2023compare",
            "huang2023fish",
            "lin2021nfinbert"
        ]
	},
    "awards":[
        {
            "title":"Legal Compliance Special Award, Lawsnote Legal-Tech Hackathon",
            "year": 2021,
            "description":"Auxiliary System for Duty of Disclosure in Insurance Law: Designed the backend logistics of the system and leveraged modern sentence embedding models to aid in retrieving related cases based on users' queries."
        }
    ],  
	"service":{
		"organizational leadership":[
			{
				"venue":"ccClub (a Python Community)",
				"title":"Director and Teaching Assitant",
				"year":[2018, 2019, 2020, 2021, 2022, 2023, 2024],
                "description":"Python Data Analysis Workshop: Designed comprehensive materials and delivered engaging lectures on Python for data analysis, emphasizing practical examples, hands-on exercises, and key libraries.\\\\ - Computer Science Study Group: Led a team of 8 to organize a study schedule covering algorithms, object-oriented design, and machine learning for individuals with non-CS backgrounds and basic programming language skills.\\\\ - Programming Study Group: Designed programming assignments and provided technical advice based on students' ideas for their final projects in a 200-person study group.\\\\ - Google Machine Learning Crash Course: Addressed environmental problems and explained machine learning techniques to beginners, achieving an 88% satisfaction rate after the class."
			}
		]
    },
	"skills":[
		"- Extensive programming experience with Python, particularly for machine learning projects on Unix platforms.\\\\",
		"- Proficient in machine learning related packages such as PyTorch, Transformers, Sentence-BERT, LangChain, Scikit-learn, NumPy, Pandas and Matplotlib.\\\\",
		"- Fluent in English and native proficiency in Traditional Chinese."
	]
}
